#+TITLE: GNU Emacs training

** To be seen


|                                           | Time | Spent |
|-------------------------------------------+------+-------|
| Moving the cursor                         |   10 |       |
| Org-mode quick start                      |   20 |       |
| Elisp 15 minutes tutorial                 |   20 |       |
| Regular expressions                       |   20 |       |
| Building regular expressions              |   30 |       |
| Interactive search                        |   30 |       |
| Basic (re-searching)                      |   30 |       |
| Deleting, killing, yanking                |   30 |       |
| Interactive macros                        |   30 |       |
| Renaming files with a macro and a counter |      |       |
| Using the mark                            |      |       |
|-------------------------------------------+------+-------|
| Functions, lambda and commands            |   30 |       |
| Manipulating lists and their elements     |   30 |       |
| Mapping over a list                       |   30 |       |
| Programmatic buffers manipulations        |   30 |       |
| Defining variables and functions          |   30 |       |
| Defining variables and options            |   30 |       |
| Using interactive                         |   30 |       |
| File cleanup                              |      |       |
|-------------------------------------------+------+-------|
| Emacs history overview                    |      |       |
| Emacs directory overview                  |      |       |
| Emacs vocabulary                          |      |       |
| Modifiers and keybindings                 |      |       |
|-------------------------------------------+------+-------|
| Total minutes                             |  180 |     0 |
#+TBLFM: @24$2=vsum(@3..@-1)::@25$3=vsum(@3..@-1)
